Week 5 Pandas Data frame

    Name: Sathish Kumar Rajendiran
    Task: Class work - Pandas Data frame
    Date: 7/29/2020

In [11]:
#import libraries
import os
import csv
import numpy as np
import pandas as pd

#verify current directory
os.getcwd()

'/Users/sathishrajendiran/ist652-python'

In [12]:
# define dictionary with State, Postcode, Area and Population info

state_data = {'State':['Alabama','Alaska','Arizona','Arkansas'],'PostCode':['AL','AK','AZ','AR'],'Area':['52,423','656,424','*','53,182'],'Pop':['4,040,587','550,043','3,665,228','2,350,750']}

type(state_data) #dict

#create a dataframe from state_data dictionary
statedf = pd.DataFrame(state_data, columns=['State','PostCode','Area','Pop'])
statedf.head()

      State PostCode     Area        Pop
0   Alabama       AL   52,423  4,040,587
1    Alaska       AK  656,424    550,043
2   Arizona       AZ        *  3,665,228
3  Arkansas       AR   53,182  2,350,750

In [13]:
#set State as the index column
statedf = statedf.set_index('State')
statedf.head()

#replace '* with '0' value
statedf = statedf.replace('*','0')
statedf

         PostCode     Area        Pop
State
Alabama        AL   52,423  4,040,587
Alaska         AK  656,424    550,043
Arizona        AZ        0  3,665,228
Arkansas       AR   53,182  2,350,750

In [14]:
#create a function to replace a string
def item_replace(xstr):
    return xstr.replace(',','')

In [15]:
#replace ',' from Area and Population values
statedf['Area'] = statedf['Area'].map(item_replace)
statedf['Pop'] = statedf['Pop'].map(item_replace)
statedf

         PostCode    Area      Pop
State
Alabama        AL   52423  4040587
Alaska         AK  656424   550043
Arizona        AZ       0  3665228
Arkansas       AR   53182  2350750

In [16]:
#convert Area and Population values to float
statedf['Area'] = statedf['Area'].astype('float')
statedf['Pop'] = statedf['Pop'].astype('float')

# statedf['Area'] = statedf['Area'].astype(np.float)
# statedf['Pop'] = statedf['Pop'].astype(np.float)

In [17]:
#calculate mean area and replace 0 with mean area value
mean_area = statedf['Area'].mean()
statedf['Area'] = statedf['Area'].replace(0,mean_area)

# statedf['Area']= statedf['Area'].mask(statedf['Area']==0,mean_area)

In [18]:
#display top 2 rows
print('top two rows:\n',statedf.head(2))

#display bottom 2 rows
print('\nbottom two rows:\n',statedf.tail(2))

#display all rows
statedf

top two rows:
         PostCode      Area        Pop
State
Alabama       AL   52423.0  4040587.0
Alaska        AK  656424.0   550043.0

bottom two rows:
          PostCode       Area        Pop
State
Arizona        AZ  190507.25  3665228.0
Arkansas       AR   53182.00  2350750.0

         PostCode       Area        Pop
State
Alabama        AL   52423.00  4040587.0
Alaska         AK  656424.00   550043.0
Arizona        AZ  190507.25  3665228.0
Arkansas       AR   53182.00  2350750.0